Revit 2026 API

# AssemblyInstanceIsValidNamingCategory Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidNamingCategory(
	Document document,
	ElementId namingCategoryId,
	ICollection<ElementId> assemblyMemberIds
)
```
```vb
Public Shared Function IsValidNamingCategory (
	document As Document,
	namingCategoryId As ElementId,
	assemblyMemberIds As ICollection(Of ElementId)
) As Boolean
```
```cpp
public:
static bool IsValidNamingCategory(
	Document^ document,
	ElementId^ namingCategoryId,
	ICollection<ElementId^>^ assemblyMemberIds
)
```
```fsharp
static member IsValidNamingCategory :
        document : Document *
        namingCategoryId : ElementId *
        assemblyMemberIds : ICollection<ElementId> -> bool
```

#### Parameters

document Document

namingCategoryId ElementId

assemblyMemberIds ICollectionElementId

#### Return Value

Boolean

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace